#------------------------------------------------------------
#1.
# pin = '880122-1234567'
# birthday = '홍길동님 생년월일 : ' + pin[0:6]
# if(int(pin[7])%2 == 1):
#     gender = '성별 : 남자'
# else:
#     gender = '성별 : 여자'
# #gender = '성별 : ' + pin[7]
# print(birthday)
# print(gender)
#------------------------------------------------------------
#2.
# a = [1,3,5,4,2]
# a.sort()
# a.reverse()
# print(a)
#------------------------------------------------------------
#3.
# a=['독도는', '대한민국의', '아름다운', '섬입니다']
# result = ' '.join(a)
# print(result)
#------------------------------------------------------------
#4.
# a = (1,2,3)
# a = a + (4,)
# print(a)
#------------------------------------------------------------
#5.
# a = b = [1,2,3]
# a[1] = 4
# print(b)
# 이유 : a 와 b 가 첫번째 줄에서 1,2,3 요소를 가진 리스트를 같은 객체를 가리키고 있기 때문에 a를 통해서 수정을 하게 되어도 b 가 가리키는 객체가 같이 수정됨
#------------------------------------------------------------
#6.
# cnt = 1
# while cnt<6:
#     starnum = cnt
#     while starnum>0:
#         print('*', end='')
#         starnum-=1
#     print('')
#     cnt+=1
#------------------------------------------------------------
#7.
# kor_score = [77, 88, 76, 44, 56]
# math_score = [96, 99, 100, 55, 66]
# eng_score = [50,60,70,80,90]
# midterm_score = [kor_score, math_score, eng_score]
#
# print("국어 과목의 총점 : {0} 평균 : {1}".format(sum(kor_score), sum(kor_score)/len(kor_score)))
# print("수학 과목의 총점 : {0} 평균 : {1}".format(sum(math_score), sum(math_score)/len(math_score)))
# print("엉어 과목의 총점 : {0} 평균 : {1}".format(sum(eng_score), sum(eng_score)/len(eng_score)))
#------------------------------------------------------------
#8.
# life = {"animal":
#             {"cats": {"Kim": {},
#                       "Lee": {},
#                       "Choi": {}
#                       },
#              "octopi": {},
#              "emnu": {}},
#         "plants": {},
#         "other": {}}
# print(life)